# Successful Movies

---

## Project 3 - Part 3

## Create MySQL Database
* ### ***What Makes a Movie Successful?***

* ### Ingrid Arbieto Nelson

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Successful-Movies" data-toc-modified-id="Successful-Movies-1">Successful Movies</a></span><ul class="toc-item"><li><span><a href="#Project-3---Part-3" data-toc-modified-id="Project-3---Part-3-1.1">Project 3 - Part 3</a></span></li><li><span><a href="#Create-MySQL-Database" data-toc-modified-id="Create-MySQL-Database-1.2">Create MySQL Database</a></span><ul class="toc-item"><li><span><a href="#What-Makes-a-Movie-Successful?" data-toc-modified-id="What-Makes-a-Movie-Successful?-1.2.1"><strong><em>What Makes a Movie Successful?</em></strong></a></span></li><li><span><a href="#Ingrid-Arbieto-Nelson" data-toc-modified-id="Ingrid-Arbieto-Nelson-1.2.2">Ingrid Arbieto Nelson</a></span></li></ul></li><li><span><a href="#Business-Problem" data-toc-modified-id="Business-Problem-1.3">Business Problem</a></span><ul class="toc-item"><li><span><a href="#Data-Source" data-toc-modified-id="Data-Source-1.3.1">Data Source</a></span></li><li><span><a href="#Part-3" data-toc-modified-id="Part-3-1.3.2">Part 3</a></span></li><li><span><a href="#Specifications---Database" data-toc-modified-id="Specifications---Database-1.3.3">Specifications - Database</a></span></li><li><span><a href="#Required-Transformation-Steps-for-Title-Basics:" data-toc-modified-id="Required-Transformation-Steps-for-Title-Basics:-1.3.4">Required Transformation Steps for Title Basics:</a></span></li><li><span><a href="#MySQL-Database-Requirements" data-toc-modified-id="MySQL-Database-Requirements-1.3.5">MySQL Database Requirements</a></span></li><li><span><a href="#Deliverables" data-toc-modified-id="Deliverables-1.3.6">Deliverables</a></span></li></ul></li><li><span><a href="#ETL-of-Movie-Data" data-toc-modified-id="ETL-of-Movie-Data-1.4">ETL of Movie Data</a></span><ul class="toc-item"><li><span><a href="#Imports" data-toc-modified-id="Imports-1.4.1">Imports</a></span></li><li><span><a href="#Load-Data" data-toc-modified-id="Load-Data-1.4.2">Load Data</a></span></li><li><span><a href="#Normalization-&amp;-Transformations" data-toc-modified-id="Normalization-&amp;-Transformations-1.4.3">Normalization &amp; Transformations</a></span></li></ul></li><li><span><a href="#Create-MySQL-Database" data-toc-modified-id="Create-MySQL-Database-1.5">Create MySQL Database</a></span></li></ul></li></ul></div>

## Business Problem
> *For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.*

Over the course of this project, you will:

* **Part 1**: Download several files from IMDB’s movie data set and filter out the subset of moves requested by the stakeholder.
* **Part 2**: Use an API to extract box office revenue and profit data to add to your IMDB data and perform exploratory data analysis.
* **Part 3**: Construct and export a MySQL database using your data.
* **Part 4**: Apply hypothesis testing to explore what makes a movie successful.
* **Part 5** (Optional): Produce a Linear Regression model to predict movie performance.

<img src ="Images/theater.png">

### Data Source 

<img src = "Images/blue_long_1-8ba2ac31f354005783fab473602c34c3f4fd207150182061e425d366e4f34596.svg">

* **TMDB** Provides Several Files with varied information for Movies, TV Shows, Made for TV Movies, etc.

### Part 3
> For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

### Specifications - Database
* Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

* Specifically, they want the data from the following files included in your database:
  * Title Basics:
     * Movie ID (tconst)
     * Primary Title
     * Start Year
     * Runtime (in Minutes)
     * Genres
  * Title Ratings
     * Movie ID (tconst)
     * Average Movie Rating
     * Number of Votes
  * The TMDB API Results (multiple files)
     * Movie ID
     * Revenue
     * Budget
     * Certification (MPAA Rating)

* You should normalize the tables as best you can before adding them to your new database.

   * Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
   * You only need to keep the imdb_id, revenue, budget, and certification columns

### Required Transformation Steps for Title Basics:
* Normalize Genre:

  * Convert the single string of genres from title basics into 2 new tables.
    1. title_genres: with the columns:

       * tconst
       * genre_id
    2. genres:

       * genre_id
       * genre_name
* Discard unnecessary information:

  * For the title basics table, drop the following columns:
     * "original_title" (we will use the primary title column instead)
     * "isAdult" ("Adult" will show up in the genres so this is redundant information).
     * "titleType" (every row will be a movie).
     * "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
  * Do not include the title_akas table in your SQL database.
     * You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

### MySQL Database Requirements
* Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

* Create a new database on your MySQL server and call it "movies".

* Make sure to have the following tables in your "movies" database:

  * title_basics
  * title_ratings
  * title_genres
  * genres
  * tmdb_data
* Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

* After creating each table, show the first 5 rows of that table using a SQL query.

* Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

### Deliverables
Submit a link to your github respository containing the Jupyter Notebook file.

## ETL of Movie Data

### Imports

In [1]:
import json
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import Integer, Float, String, Text
from urllib.parse import quote_plus as urlquote

import warnings
warnings.filterwarnings('ignore')

### Load Data

In [2]:
# title_basics
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,126,Drama

In [3]:
# title_ratings
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       264
2  tt0000005            6.2      2608
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [4]:
# tmdb data
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres_x,homepage,id,original_language,original_title,...,genres_y,averageRating,numVotes,ordering,title_y,region,language,types,attributes,isOriginalTitle
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,"Musical,Romance",5.6,1398,12,The Fantasticks,US,NaN,imdbDisplay,NaN,0.0
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,"Drama,Romance",8.1,155839,51,In the Mood for Love,US,NaN,imdbDisplay,NaN,0.0
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,"Action,Adventure,Animation",5.4,8948,10,Heavy Metal 2000,US,NaN,imdbDisplay,NaN,0.0
3,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,"Action,Adventure,Animation",5.4,8948,13,Heavy Metal: F.A.K.K.,US,NaN,working,NaN,0.0
4,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,"Action,Adventure,Animation",5.4,8948,17,Heavy Metal: F.A.K.K.²,US,NaN,working,NaN,0.0

### Normalization & Transformations

#### Drop Unnecessary Columns

In [5]:
# get tmdb data column names
tmdb_data.columns

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres_x', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title_x', 'video',
       'vote_average', 'vote_count', 'certification', 'titleType',
       'primaryTitle', 'originalTitle', 'isAdult', 'startYear',
       'runtimeMinutes', 'genres_y', 'averageRating', 'numVotes', 'ordering',
       'title_y', 'region', 'language', 'types', 'attributes',
       'isOriginalTitle'],
      dtype='object')

In [6]:
# only keeping these columns
tmdb_data = tmdb_data[['imdb_id','revenue','budget','certification']]
tmdb_data.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0118694  12854953.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0119273         0.0  15000000.0             R
4  tt0119273         0.0  15000000.0             R

In [7]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [8]:
# drop titleType, originalTitle, isAdult columns
title_basics = title_basics.drop(columns=['titleType','originalTitle', 'isAdult'])

In [9]:
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

#### Normalize Genres

In [10]:
# get list of unique genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002.0,126,Drama,[Drama]
...,...,...,...,...,...,...
86559,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
86560,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86561,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
86562,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86563,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [11]:
# explode genres
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
86562,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
86562,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
86562,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
86563,tt9916362,Coven,2020.0,92,"Drama,History",Drama
86563,tt9916362,Coven,2020.0,92,"Drama,History",History

In [12]:
# get unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [13]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [14]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.head()

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18
1  tt0062336        Drama         7
2  tt0069049        Drama         7

In [16]:
# drop genres_split column
title_genres = title_genres.drop(columns=['genres_split'])

In [17]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [18]:
# Convert genre map dictionary to dataframe
genres = pd.DataFrame({'genre_id': genre_map.values(),
                       'genre_name': genre_map.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [19]:
# drop genres columns from title basics
title_basics = title_basics.drop(columns=['genres','genres_split'])
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

## Create MySQL Database

In [20]:
# get mysql login info
with open('/Users/sweet/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [21]:
db_name = 'movies'
connection_str = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"

In [22]:
# create connection
engine = create_engine(connection_str)

In [23]:
# create movies database
create_database(connection_str)

In [24]:
# check if database exists
database_exists(connection_str)

True

In [25]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [26]:
# check datatypes
title_basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

In [27]:
# get max string length
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

# create schema dictionary for title_basics
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'runtimeMinutes': Integer()}

In [28]:
# Save title_basics table to SQL
title_basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

86564

In [29]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [30]:
# Show first five rows of table
q = '''SELECT * from title_basics
       LIMIT 5;'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [31]:
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [32]:
# create schema dictionary for title_ratings
ratings_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()}

In [33]:
# Save title_ratings table to SQL
title_ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

496896

In [34]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [35]:
# Show first five rows of table
q = '''SELECT * from title_ratings
       LIMIT 5;'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       264
2  tt0000005            6.2      2608
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [36]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [37]:
# Save title_genres table to SQL
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

161686

In [38]:
# Show first five rows of table
q = '''SELECT * from title_genres
       LIMIT 5;'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [39]:
genres.dtypes

genre_id       int64
genre_name    object
dtype: object

In [40]:
## Set the dataframe index and use index=True 
genres.set_index('genre_id').to_sql('genres',engine,index=True, if_exists='replace')

26

In [41]:
# Show first five rows of table
q = '''SELECT * from genres
       LIMIT 5;'''
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [42]:
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [43]:
# get max string length for objects
imdb_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

# Create schema dictionary for tmdb_data table
tmdb_schema = {
    'imdb_id': String(imdb_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1)}

In [44]:
# Save title_ratings table to SQL
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

946

In [45]:
# Show first five rows of table
q = '''SELECT * from tmdb_data
       LIMIT 5;'''
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0          None
1  tt0118694  12855000.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0119273         0.0  15000000.0             R
4  tt0119273         0.0  15000000.0             R

In [46]:
# show all tables in movies database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data